lockExchange/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| ========= | |
| \\ / F ield | OpenFOAM: The Open Source CFD Toolbox |
| \\ / O peration | Version: 2.0.x |
| \\ / A nd | Web: www.OpenFOAM.com |
| \\/ M anipulation | |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (10 0 0)
    (10 2 0)
    (0 2 0)
    (0 0 2)
    (10 0 2)
    (10 2 2)
    (0 2 2));

blocks
(
    hex (0 1 2 3 4 5 6 7) (200 40 1) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    wall left
        (
            (0 4 7 3)
        )
   wall right
        (
            (1 5 6 2)
        )
  wall bottom
        (
            (0 1 5 4)
        )
  wall top
        (
            (3 2 6 7)
        )
  empty frontBack
        (
            (0 1 2 3)
            (4 5 6 7)
        )
);

mergePatchPairs
(
);

// ************************************************************************* //
