lockExchange/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| ========= | |
| \\ / F ield | OpenFOAM: The Open Source CFD Toolbox |
| \\ / O peration | Version: 2.0.x |
| \\ / A nd | Web: www.OpenFOAM.com |
| \\/ M anipulation | |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location "constant";
    object transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Dab Dab [0 2 -1 0 0 0 0] 1e-06;
alphatab alphatab [0 0 0 0 0 0 0] 1;

phase1
{
    transportModel Newtonian;
    nu nu [0 2 -1 0 0 0 0] 1e-06;
    rho rho [1 -3 0 0 0 0 0] 1000;
}

phase2
{
    transportModel Newtonian;
    nu nu [0 2 -1 0 0 0 0] 1e-06;
    rho rho [1 -3 0 0 0 0 0] 990;
}

// ************************************************************************* //
