lockExchange/0.org/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| ========= | |
| \\ / F ield | OpenFOAM: The Open Source CFD Toolbox |
| \\ / O peration | Version: 2.0.x |
| \\ / A nd | Web: www.OpenFOAM.com |
| \\/ M anipulation | |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    location "0";
    object p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [1 -1 -2 0 0 0 0];

internalField uniform 0;

boundaryField
{
    left
    {
        type buoyantPressure;
    }
    right
    {
        type buoyantPressure;
    }
    bottom
    {
        type buoyantPressure;
    }
    top
    {
        type buoyantPressure;
    }
    frontBack
    {
        type empty;
    }
}


// ************************************************************************* //
