lockExchange/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| ========= | |
| \\ / F ield | OpenFOAM: The Open Source CFD Toolbox |
| \\ / O peration | Version: 2.0.x |
| \\ / A nd | Web: www.OpenFOAM.com |
| \\/ M anipulation | |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location "system";
    object fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha1.*"
    {
        solver smoothSolver;
        smoother GaussSeidel;
        tolerance 1e-7;
        relTol 0;
        nSweeps 1;
    }

    p_rgh
    {
        solver GAMG;
        tolerance 1e-7;
        relTol 0.01;
        smoother GaussSeidel;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator faceAreaPair;
        mergeLevels 1;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol 0;
    }

    U
    {
        solver smoothSolver;
        smoother GaussSeidel;
        tolerance 1e-7;
        relTol 0.1;
        nSweeps 1;
    }

    UFinal
    {
        $U;
        relTol 0;
    }
}

PIMPLE
{
    momentumPredictor yes;
    nOuterCorrectors 1;
    nCorrectors 2;
    nNonOrthogonalCorrectors 0;
    pRefValue 0;
    pRefPoint (0.1 0.1 1);
}


// ************************************************************************* //
